benchbnb/benchbnb/app/models/user.rb

    def self.find_by_credentials(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test1"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "8JeMnjYckk8ohK7cDoyEVw"], ["updated_at", "2021-08-31 18:21:05.531693"], ["id", 1]]